IDENTIFICATION DIVISION. 
PROGRAM-ID. SOLUTION. 

ENVIRONMENT DIVISION. 
INPUT-OUTPUT SECTION. 
FILE-CONTROL. 
SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL. 
      
DATA DIVISION. 
    FILE SECTION. 
    FD SYSIN. 
    01 INPUT-LINE PIC X(255).
    88 EOF VALUE HIGH-VALUES.
      
    WORKING-STORAGE SECTION.
    01 MEAL-COST PIC 9(3)V9(2).
    01 TIP-PERCENT PIC 9(3)V9(2).
    01 TAX-PERCENT PIC 9(3)V9(2).
    01 TIP PIC 9(3)V9(2).
    01 TAX PIC 9(3)V9(2).
    01 TOTAL-COST PIC 9(3)V9(2).
    01 ROUNDED-TOTAL-COST PIC 9(3).
    01 FORMATTED-RESULT PIC Z(3).
 
PROCEDURE DIVISION.
    OPEN INPUT SYSIN
    READ SYSIN
    AT END SET EOF TO TRUE
    NOT AT END
    MOVE INPUT-LINE TO MEAL-COST
    READ SYSIN
    AT END SET EOF TO TRUE
    NOT AT END
    MOVE INPUT-LINE TO TIP-PERCENT
    READ SYSIN
    AT END SET EOF TO TRUE
    NOT AT END
    MOVE INPUT-LINE TO TAX-PERCENT
    END-READ.
      
    COMPUTE TIP= (MEAL-COST * TIP-PERCENT / 100).
    COMPUTE TAX= (MEAL-COST * TAX-PERCENT / 100).
      
    COMPUTE TOTAL-COST= MEAL-COST + TIP + TAX.
      
    COMPUTE ROUNDED-TOTAL-COST ROUNDED = TOTAL-COST.
      
    MOVE ROUNDED-TOTAL-COST TO FORMATTED-RESULT.
    
    DISPLAY "The total meal cost is" FORMATTED-RESULT " dollars.". 
      
    CLOSE SYSIN.
      
STOP RUN.
