       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO_COBOL.
      
       ENVIRONMENT DIVISION.
      
       DATA DIVISION.
      
       PROCEDURE DIVISION.
   
         DISPLAY "hello cobol". 
      
      STOP RUN.
