
       IDENTIFICATION DIVISION.
       PROGRAM-ID. THEORY.
       
       ENVIRONMENT DIVISION.
      
       DATA DIVISION.
       
       PROCEDURE DIVISION.
            
            STOP RUN.

       END PROGRAM THEORY.
